export const SALONS = [
  'ТЦ "Град" пав. 559',
  'ТЦ "Coolman"',
  'Салон "Vegas" (Уручье)',
  'ТЦ "Домашний очаг"',
  'ТЦ "ТРЮМ"',
  'ТЦ "Мост"',
  'ТЦ "ОЗЕРЦО"',
  'ТЦ "ЗАМОК" Корона',
  'ТЦ "Корона-ДОМ"',
  'ТЦ "КАМЕЛОТ"',
  'ТЦ "Globo"',
  'ТЦ "Palazzo"',
  'ТЦ "Армада"',
  'ТЦ "Стиль"',
  'ТРЦ "МЕГА"',
  'МЦ "Крепость"',
  'ТРЦ "Мандарин Плаза"',
  'ТЦ "КОРОНА"',
  'ТЦ "Спутник"',
  'ТВК "Апельсин"',
  'Центр мебели "КОМОД+"',
  'ТЦ "Дом мебели"',
  'ТЦ "ВамРад"',
  'ТЦ "Интериум"',
];

export function isValidSalon(salon) {
  return typeof salon === "string" && SALONS.includes(salon);
}
